# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. Combined C2f_MSAM and FasterNeXt modules.

# Parameters
nc: 6  # number of classes
scales:  # model compound scaling constants, i.e., 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3,257,200 parameters,  3,257,184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11,166,560 parameters, 11,166,544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25,902,640 parameters, 25,902,624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43,691,520 parameters, 43,691,504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68,229,648 parameters, 68,229,632 gradients, 258.5 GFLOPs

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f_MSAM, [128, True]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f_MSAM, [256, True]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, FasterNeXt, [512]]  # 6  # 使用 FasterNeXt 模块替代部分 C2f_MSAM
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, FasterNeXt, [1024]]  # 8  # 使用 FasterNeXt 模块替代部分 C2f_MSAM
  - [-1, 1, SPPF, [1024, 5]]  # 9

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # Upsample P5 to P4
  - [[-1, 6], 1, Concat, [1]]  # Concatenate backbone P4 (layer 6)
  - [-1, 3, C2f, [512]]  # 12  # 使用 C2f 模块处理 concatenated 特征

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # Upsample P4 to P3
  - [[-1, 4], 1, Concat, [1]]  # Concatenate backbone P3 (layer 4)
  - [-1, 3, C2f, [256]]  # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]  # Downsample P3 to P4
  - [[-1, 12, 6], 1, Concat, [1]]  # Concatenate head P4 (layers 12 and 6)
  - [-1, 3, C2f, [512]]  # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]  # Downsample P4 to P5
  - [[-1, 9], 1, Concat, [1]]  # Concatenate head P5 (layer 9)
  - [-1, 3, C2f, [1024]]  # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)

# Additional Parameters (optional, based on your specific model requirements)
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.25  # scales convolution channels
